% =======================================================
% file: plAxes
% detail:
% 可操作楕円体を与える行列Aを受けとり、
% 対角行列になっているか調べた後、主軸の長さを返します。
% drawEllipsoid関数とほぼ同じです。
% 
% input: A(楕円体を与える3×３の行列)
% output:[a b c](主軸の長さ)
% =======================================================
function func=plAxes(A)

A=(A+A')/2;

if isDiag(A)==1
D=A;
else
[V,D]=eig(A);%対角化
%A=V'*D*Vを満たすV,Dを求めます。(Dが対角行列)
end

%長軸の長さを求めます。
a=1/sqrt(D(1,1));
b=1/sqrt(D(2,2));
c=1/sqrt(D(3,3));

func=[a b c];

end